
"_BASE_USED_" = "uk";
/* Use the _ADVANCED_EXTRA_WIDTH_ (if needed) to fit the method description properly */
"_ADVANCED_EXTRA_WIDTH_" = "68.0";
/* Use the _PREFERENCES_EXTRA_WIDTH_ (if needed) to fit the action to perform description properly */
"_PREFERENCES_EXTRA_WIDTH_" = "0.0";
"General" = "Головні";
"File Access" = "Доступ до файлів";
"Performance" = "Продуктивність";
"Finder Extension" = "Finder розширення";
"Love" = "Love";
"OK" = "OK";
"Done" = "Виконано";
"Yes" = "Так";
"No" = "Ні";
"Don't show again" = "Не показувати знову";
"Set as default compressor" = "Встановити компресор за замовчуванням";
"Not now" = "Не зараз";
"Want to make Keka your default compressor?" = "Хочете зробити Keka компресором за замовчуванням?";
"This means that all the compatible files will be extracted with Keka by now. You can set this later in the Keka Preferences." = "Це означає, що всі сумісні файли будуть розпаковані за допомогою Keka. Ви можете встановити цей параметр пізніше в налаштуваннях Keka.";
"Really want to close Keka?" = "Чи дійсно хочеться закрити Keka?";
"The current operations will be canceled. If you choose to wait and quit Keka will exit when all work is done." = "Поточні операції будуть скасовані. Якщо ви вирішите зачекати і вийти — Keka вийде коли буде виконана вся робота.";
"Password needed" = "Потрібен пароль";
"File \"%@\" needs a password to be extracted" = "Файлу \"%@\" потрібен пароль для розпакування";
"File \"%@\" needs a special encoding to be extracted" = "Файл \"%@\" потребує спеціального кодування для розпакування";
"Extraction of \"%@\" done" = "Розпакування \"%@\" завершено";
"Extraction of \"%@\" failed." = "Розпакування \"%@\" не вдалося.";
"Extraction of %i files done" = "Розпаковано %i файлів завершено";
"Extraction complete" = "Розпакування завершено";
"Extraction fail" = "Не вдалося розпакувати";
"Compression complete" = "Стиснення завершено";
"File \"%@\" created" = "Файл \"%@\" створено";
"Compression fail" = "Не вдалося стиснути";
"File \"%@\" cannot be created" = "Файл \"%@\" неможливо створити";
"\n(using fallback folder)" = "\n(using fallback folder)";
"Operation not implemented" = "Операція не реалізована";
"Performing operation..." = "Виконання операції...";
"Waiting..." = "Очікування...";
"Extracting \"%@\"" = "Розпаковування \"%@\"";
"Extracting \"%@...\"" = "Розпаковування \"%@...\"";
"Creating %@ file..." = "Створення %@ файлу...";
"Creating file \"%@\"" = "Створення файлу \"%@\"";
"Creating file \"%@...\"" = "Створення файлу \"%@...\"";
"Volume name:" = "Назва тому:";
"Select the encoding for \"%@\"" = "Виберіть кодування для \"%@\"";
"Time elapsed: %d:%@%d:%@%d hours%@" = "Часу минуло: %d:%@%d:%@%d годин%@";
"Time elapsed: %d:%@%d minutes%@" = "Часу минуло: %d:%@%d хвилин%@";
"Time elapsed: %d seconds%@" = "Часу минуло: %d секунд%@";
"%.0f seconds" = "%.0f секунд";
"%i:%02i minutes" = "%i:%02i хвилин";
"%i:%02i:%02i hours" = "%i:%02i:%02i годин";
"Pause" = "Пауза";
"Continue" = "Продовжити";
"Operation paused" = "Операція призупинена";
"Cancel" = "Скасувати";
"Close" = "Закрити";
"Operation failed" = "Не вдалося виконати операцію";
"Operation failed with error code %d" = "Не вдалося виконати операцію з кодом помилки %d";
"Choose a name and folder to start the compression" = "Виберіть ім'я та папку, щоб розпочати стиск";
"Creation of \"%@\" failed" = "Створення \"%@\" не вдалося";
"Creating \"%@\"" = "Створення \"%@\"";
"Preparing extraction..." = "Підготовка розпаковування…";
"Choose a folder to extract this file" = "Виберіть папку, щоб витягти цей файл";
"Choose where do you want to extract \"%@\"" = "Виберіть, куди ви хочете витягти \"%@\"";
"Select all the volumes from \"%@\" or the folder that contains them" = "Виділіть усі томи з \"%@\" або папку, яка їх містить";
"Select the folder that contains \"%@\"" = "Виберіть папку, яка містить \"%@\"";
"Extraction of \"%@\" failed" = "Розпакування \"%@\" не вдалося";
"Keka - %i on queue" = "Keka - %i на черзі";
"Keka can't create this %@ image" = "Keka не може створити %@ образ";
"You can only create %@ images with a single folder. Try to put all your files in a folder and drop it to Keka to create the %@ image." = "Ви можете лише створити %@ образ. Спробуйте помістити всі ваші файли в папку і помістіть їх у Keka, щоб створити %@ образ";
"Keka can't create this @% tarball" = "Keka не може створити цей @% тарбол";
"This operation is not supported on %@." = "Ця операція не підтримується %@.";
"Compress \"%@\" in %@ to..." = "стиснути \"%@\" в %@ до...";
"Compress in %@ to..." = "Стиснути в %@ до...";
"Save as:" = "Зберегти як:";
"Compress" = "Стиснути";
"Extract \"%@\" to..." = "Розпакувати \"%@\" до…";
"Extract as:" = "Розпакувати як:";
"Extract" = "Розпакувати";
"About %i seconds" = "близько %i секунд";
"About %i minutes" = "близько %i хвилин";
"About %i hours" = "близько %i годин";
"About %i days" = "близько %i днів";
"About %i weeks" = "близько %i тижні";
"About %i months" = "близько %i місяці";
"About %i years" = "близько %i років";
"About a minute" = "близько 1 хвилини";
"About an hour" = "близько 1 години";
"About a day" = "близько 1 дня";
"About a week" = "близько 1 тиждень";
"About a month" = "близько 1 місяць";
"About a year" = "близько 1 року";
"Finishing..." = "Finishing...";
"Can't show progress time..." = "Неможливо показати час прогресу...";
"Password for \"%@\"" = "Пароль для \"%@\"";
"Format" = "Формат";
"Method" = "Метод";
"Method:" = "Метод:";
"No compression" = "Без стиснення";
"Fastest, less compression" = "Найшвидше, менше стиснення";
"Fast, less compression" = "Швидко, менше стиснення";
"Normal" = "Звичайнe";
"Slow, more compression" = "Повільно, більше стиснення";
"Slowest, more compression" = "Найповільніше, більше стиснення";
"Compression" = "Стиснення";
"Extraction" = "Розпаковування";
"Keka can't use the \"extlx.plist\" list, please get in contact with the developers.\n\nNow Keka will quit." = "Keka не може використовувати список \"extlx.plist\", будь ласка зверніться до розробників.\n\nТепер Keka завершить роботу.";
"Keka is dying!" = "Keka вмирає!";
"Ask each time" = "Запитувати кожен раз";
"Next to original file" = "Поруч із оригінальним файлом";
"Custom folder..." = "Власна папка...";
"Same as original file" = "Те ж, що й у вихідному файлі";
"Custom name..." = "Власна назва...";
"Archive" = "Архів";
"Set as default folder" = "Встановити папку за умовчанням";
"Perform automatic action" = "Виконати автоматичну дію";
"Always compress" = "Завжди стискати";
"Always extract" = "Завжди витягувати";
"1.4 MB Floppy" = "1.4 MB Дискета";
"650 MB CD" = "650 MB CD";
"700 MB CD" = "700 MB CD";
"4.7 GB DVD" = "4.7 GB DVD";
"Drop here to extract" = "Залиште тут, щоб витягти";
"Drop here to compress" = "Залиште тут, щоб стиснути";
"Binary \"%@\" is not accessible" = "Бінарний \"%@\" недоступний";
"The first part \"%@\" can't be found" = "Перша частина \"%@\" не знайдена";
"Unable to extract a folder" = "Не вдалося розпакувати папку";
"unknown" = "невідомо";
"Unknown error" = "Невідома помилка";
"Error code %d using \"%@\"\n%@" = "Код помилки %d використання \"%@\"\n%@";
"Keka was unable to create the extraction package" = "Не вдалося створити пакет видобутку";
"No errors found" = "Не знайдено жодних помилок";
"Minor error, the operation may be done well" = "Незначна помилка, операція може бути завершена";
"Fatal error" = "Фатальна помилка";
"CRC error occurred, maybe the file is corrupt" = "Сталася помилка CRC, можливо, файл пошкоджено";
"Attempt to modify an archive previously locked" = "Спроба змінити раніше заблокований архів";
"Maybe you don't have permission to write or your disk is full" = "Можливо, у вас немає дозволу писати, або ваш диск заповнений";
"Can't open the file, maybe you don't have read permission" = "Не вдається відкрити файл, можливо, ви не маєте дозволу на читання";
"Command line error, please contact with the developer" = "Помилка командного рядка. Зверніться до розробника";
"Not enough memory. Try to close some programs and repeat the operation" = "Не вистачає пам'яті. Спробуйте закрити деякі програми і повторити операцію";
"Can't create the file, maybe you don't have permission or free space" = "Неможливо створити файл, можливо, у вас немає дозволу або вільного місця";
"Canceled manually" = "Скасовано вручну";
"Bad password, try again" = "Неправильний пароль, повторіть спробу";
"This archive is locked" = "Цей архів заблоковано";
"Write error. No permission? No space left?" = "Помилка запису. Немає дозволу? Не залишилося місця?";
"Can't open the file, maybe it's not accessible" = "Не вдається відкрити файл, можливо, він недоступний";
"No files matching the mask" = "Немає файлів, що відповідають масці";
"There were some read errors" = "There were some read errors";
"Give access" = "Надати доступ";
"Just folder access" = "Просто доступ до папки";
"Quit" = "Вийти";
"More information" = "Більше інформації";
"Keka needs file access" = "Keka потребує доступу до файлів";
"Give home access" = "Надати доступ до домашньої директорії";
"Customize" = "Налаштувати";
"Keka needs access to the source file/s." = "Keka потребує доступу до вихідних файлів.";
"In order to work seamlessly with your files, Keka needs local access to the Mac disk." = "Щоб без проблем працювати з файлами, Keka потребує локальний доступ до диска Mac.";
"\nSimply click on \"Give access to Keka\", your disk should already be selected." = "\nПросто натисніть \"Дати доступ до Keka\", ваш диск має бути вже вибраний.";
"Give access to Keka" = "Дати доступ до Keka";
"Full Mac access (Recommended)" = "Повний доступ Mac (рекомендовано)";
"Home folder access" = "Доступ до домашньої папки";
"External volumes access" = "Доступ до зовнішніх томів";
"Full Mac" = "Весь Mac";
"Home folder" = "Домашня папка";
"External volumes" = "Зовнішні томи";
"Show in context menu" = "Показати в контекстному меню";
"External disk: %@" = "Зовнішній диск: %@";
"An extension is required" = "Потрібно розширення";
"In order to set Keka as the default application, you need to install an extension. Click on \"More information\" to follow the required steps.\n\nRemember that you can always set Keka as the default application for any format using the Finder's \"Get Info\" panel." = "Щоб встановити програму Keka як програму за умовчанням, потрібно встановити розширення. Натисніть на \"Більше інформації\" щоб виконати необхідні кроки.\n\nПам'ятайте, що ви завжди можете встановити Keka як програму за замовчуванням для будь-якого формату за допомогою Finder, панель \"Отримати інформацію\".";
"Your installed extension is obsolete and you should update it." = "Your installed extension is obsolete and you should update it.";
"Update" = "Update";
"Cannot set Keka as default" = "Неможливо встановити Keka за умовчанням";
"The intermediate application failed to launch. There is more information in the Console.app." = "Не вдалося запустити проміжну програму. Більше інформації в Console.app.";
"The intermediate application returned an undefined code." = "Проміжний додаток повернув невизначений код.";
"Keka is now set as the default application for its known formats." = "Keka тепер встановлена як стандартна програма для відомих форматів.";
"Keka set as default" = "Keka встановлюється за замовчуванням";
"There were some errors while registering the formats. There is more information in the Console.app." = "Були деякі помилки під час реєстрації форматів. Більше інформації в Console.app.";
"The intermediate application can't get access to Keka." = "Проміжний додаток не може отримати доступ до Keka.";
"The intermediate application can't find Keka." = "Проміжний додаток не може знайти Keka.";
"Show in Finder" = "Show in Finder";
"Delete" = "Delete";
"Continue without encryption" = "Продовжити без шифрування";
"The password does not match" = "Паролі не Continue without encryption";
"The password is not properly set and the file cannot be encrypted. You can cancel and set the password again or continue the process without encryption." = "Пароль встановлений неправильно, тому файл не можна зашифрувати. Ви можете скасувати та встановити пароль ще раз або продовжити процес без шифрування.";
"Use legacy encryption" = "Використовувати звичайнe шифрування";
"Using AES-256 encryption in ZIP" = "Використовувати AES-256 шифрування в ZIP";
"Note that most modern operating systems such as macOS (before macOS 11.0 Big Sur) or Windows do not support AES-256 encrypted ZIPs by default.\n\nYou can open those files easily with most third party extraction utilities." = "Зверніть увагу, що більшість сучасних операційних систем, таких як macOS (до macOS 11.0 Big Sur) або Windows, за замовчуванням не підтримують зашифровані ZIP-файли AES-256.\n\nВи можете легко відкрити ці файли за допомогою більшості сторонніх програм для вилучення.";
"Cannot create the file" = "Не вдається створити файл";
"Keka has no file access to the source file/s\nGive it access when asked or manually in the Preferences" = "Keka не має доступу до файлу до вихідного файлу/s\nНадайте йому доступ за запитом або вручну в Налаштуваннях";
"Give access to the source/s folder/s" = "Надайте доступ до папки джерел";
"Give access to the compressed file" = "Надайте доступ до стисненого файлу";
"The extension is enabled" = "Розширення ввімкнено";
"The extension is disabled" = "Розширення вимкнено";
"Enable or disable the extension" = "Увімкніть або вимкніть розширення";
"Keka will decide whether to compress or uncompress based on file format and extension. This is the recommended option." = "Keka вирішить, стискати чи розпаковувати на основі формату та розширення файлу. Це рекомендований варіант.";
"Keka will compress all files, even those that are already compressed. You can compress an already compressed file in automatic mode by dropping it to the bottom part of the drop zone." = "Keka буде стискати всі файли, навіть ті, які вже стиснуті. Ви можете стиснути вже стислий файл в автоматичному режимі, опустивши його в нижню частину зони скидання.";
"Keka will try to extract all files. You can try to extract an unknown file in automatic mode by dropping it in the bottom part of the drop zone." = "Keka спробує витягти всі файли. Ви можете спробувати витягти невідомий файл в автоматичному режимі, опустивши його в нижню частину зони скидання.";
"Show the operation log" = "Показати журнал виконання";
"Unable to process tips" = "Неможливо обробити поради";
"Already tipping a monthly %@" = "Вже даю %@ щомісяця ";
"Send a monthly %@ tip" = "Надсилати %@ щомісяця";
"Send a %@ tip" = "Надіслати %@";
"Give Keka some love ♥" = "Надати Keka трішки ♥";
"All extractions will be expanded at this location." = "Усі розпакування будуть розширені в цьому місці.";
"All compressions will be stored at this location." = "Усі стиснення будуть зберігатися в цьому місці.";
"You'll be asked where to extract each operation." = "Вас запитають, де розпакувати кожну операцію.";
"You'll be asked where to compress each operation." = "Вас запитають, де стиснути кожну операцію.";
"If Keka has File Access it will execute the operation near the source file/s, otherwise it will ask for a location. You can set Keka's File Access in the Preferences tab so this option works properly." = "Якщо Keka має доступ до файлів, він виконає операцію поблизу вихідних файлів, інакше запитає місцезнаходження. Ви можете встановити Кека на доступ до файлів на вкладці Налаштування, щоб цей параметр працював належним чином.";
"Keka has no file access to the destination folder so it needs to ask for a location.\nYou can add access to this and other folders in Keka's Preferences File Access pane." = "Keka не має доступу до файлу цільової папки, тому йому потрібно запитати місце розташування. \nВи можете додати доступ до цієї та інших папок на панелі доступу Keka до файлів \"Налаштування\".";
"The characters %@ are not compatible with the %@ format" = "Символи %@ не сумісні з форматом %@";
"The character %@ is not compatible with the %@ format" = "Символ %@ не сумісний із форматом %@";
"Stop compressing" = "Stop compressing";
"Stop extracting" = "Stop extracting";
"Resume compressing" = "Resume compressing";
"Resume extracting" = "Resume extracting";
"Pause compressing" = "Pause compressing";
"Pause extracting" = "Pause extracting";
"Compression paused" = "Compression paused";
"Extraction paused" = "Extraction paused";
"Waiting for password" = "Waiting for password";
"On queue" = "On queue";
"Applying quarantine..." = "Applying quarantine...";

/*
// MAS tips
// Note this will be used in Apple's servers
// Apple needs to have MAS translated in this language so this strings can be used
// The language used in MAS/AppleID will be used in Keka's tip strings and may not match Keka's localization
// Note that the short string is limited to 30 characters and the long string is limited to 45 characters
// Emojis cannot be used in these strings :(
*/
"Monthly sip of coffee" = "Щомісячний ковток кави";
"Gift Keka a sip of coffee each month" = "Подаруйте Keka щомісячний ковток кави";
"Monthly coffee" = "Щомісячна кава";
"Gift Keka a coffee each month" = "Подаруйте Keka щомісячну каву";
"Monthly pair of coffees" = "Щомісячна пара кави";
"Gift Keka a couple coffees each month" = "Подаруйте Keka щомісячну пару кав";
"Monthly breakfast" = "Щомісячний сніданок";
"Gift Keka a breakfast each month" = "Подаруйте Keka щомісячний сніданок";
"Tip a coffee" = "Чайові на каву";
"Tip Keka a coffee so it can stay awake" = "Дайте Keka кави, щоб вона могла не спати";
"Tip a breakfast" = "Чайові на сніданок";
"Tip Keka a breakfast so it can start fresh" = "Дайте Keka сніданок, щоб почати все з чистого аркуша";
"Tip a lunch" = "Чайові на обід";
"Tip Keka a lunch and feed it" = "Дайте Keka обід";
"Tip a dinner" = "Чайові на вечерю";
"Tip Keka a dinner so it keeps rolling" = "Дайте Keka вечерю, щоб продовжувати працювати";
"Tip a bunch of food" = "Tip a bunch of food";
"Tip Keka a new bunch of food to keep rolling" = "Дайте Keka купу їжі, щоб продовжувати працювати";
